Revit 2027 API
KeyBasedTreeEntryError Properties
The KeyBasedTreeEntryError type exposes the following members.
Properties
Name | Description
ErrorType |  Indicates which of possible types of problems with loading and/or building a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace